In [8]:
import numpy as np
import pandas as pd
csv_data=pd.read_csv(r'E:\myprogram\numpyLearning\jobs.csv')
df=csv_data.drop_duplicates()
pd.set_option('display.max_rows', 100)
print(df.head(5))

                                               title  ...  salary2
0                                            招聘数据分析师  ...  10000.0
1                                              数据分析师  ...  16000.0
2                                          数据分析师(新浪)  ...  22500.0
3                                              数据分析师  ...  16000.0
4  助理、临床样本库采样人员、软件工程师、数据库管理工程师、机械设计与结构工程师、Android...  ...      NaN

[5 rows x 11 columns]

In [13]:
df['source'].value_counts()

猎聘           580
OFweek人才网     33
斗米            17
北极星招聘          5
百姓网            5
普工招聘网          4
工厂直聘网          2
康强医疗人才网        1
Name: source, dtype: int64

In [16]:
df['experience'].value_counts()

3-5年     232
1-3年     197
不限       142
5-10年     75
10年以上      4
Name: experience, dtype: int64

In [17]:
df['education'].value_counts()

本科    489
不限     71
硕士     54
大专     26
初中      9
博士      1
Name: education, dtype: int64

In [18]:
df['company_type'].value_counts()

民营          458
上市公司         62
外商独资/办事处     45
中外合资/合作      42
国企           34
事业单位          4
个人企业          2
股份制           1
公立医院          1
其它            1
Name: company_type, dtype: int64

In [19]:
df['salary2'].mean()

14409.894688644688

In [22]:
(df.sort_values(by='salary2',ascending=False))[['company','salary2']].head(10)

           company  salary2
648      国内知名互联网企业  25000.0
550     北京友信科技有限公司  25000.0
401       北京某互联网公司  25000.0
554     北京友信科技有限公司  25000.0
211  北京百分点信息科技有限公司  25000.0
404          某金融公司  25000.0
574   北京中科恒硕科技有限公司  25000.0
177     北京快手科技有限公司  25000.0
416     某知名互联网金融公司  25000.0
163   北京永利范思科技有限公司  25000.0

In [29]:
df[['title','company']].groupby(df['company']).count().sort_values(by='title',ascending=False)['title'].head(10)

company
百度在线网络技术(北京)有限公司       7
车好多旧机动车经纪(北京)有限公司      7
深圳索信达数据技术有限公司          7
海南小易到家电子商务有限公司上海分公司    6
贝壳找房(北京)科技有限公司         5
苏州皇亭电子有限公司             5
广联达科技股份有限公司            4
北京嘀嘀无限科技发展有限公司         4
北京中油瑞飞信息技术有限责任公司       4
北京百分点信息科技有限公司          4
Name: title, dtype: int64

In [30]:
(df.sort_values(by='salary2',ascending=False))[['company_type','salary2']].head(10)

    company_type  salary2
648           民营  25000.0
550           民营  25000.0
401           民营  25000.0
554           民营  25000.0
211           民营  25000.0
404           民营  25000.0
574           民营  25000.0
177           民营  25000.0
416           民营  25000.0
163           民营  25000.0